examples/flows/compiled/mutations_before_after_handler/flow.dot
digraph "mutations_before_after_handler_flow" {
    rankdir=TB;
    node [shape=box, style=filled, fontname="Helvetica"];

    { rank=source; start_mutations_before_after_handler_flow; }

    handler_a [label="handler_a", fillcolor=lightblue];
    handler_b [label="handler_b", fillcolor=lightblue];
    router_mutations_before_after_handler_flow_line_15_seq_2 [label="router_mutations_before_after_handler_flow_line_15_seq_2\n\np['step'] = 2", fillcolor=wheat];
    router_mutations_before_after_handler_flow_line_17_seq_1 [label="router_mutations_before_after_handler_flow_line_17_seq_1\n\np['step'] = 3", fillcolor=wheat];
    start_mutations_before_after_handler_flow [label="start_mutations_before_after_handler_flow\n\np['step'] = 1", fillcolor=palegreen];

    __end__ [label="", shape=doublecircle, fillcolor=black, width=0.3, fixedsize=true];

    start_mutations_before_after_handler_flow -> handler_a;
    handler_a -> router_mutations_before_after_handler_flow_line_15_seq_2;
    router_mutations_before_after_handler_flow_line_15_seq_2 -> handler_b;
    handler_b -> router_mutations_before_after_handler_flow_line_17_seq_1;
    router_mutations_before_after_handler_flow_line_17_seq_1 -> __end__;
}
